window.alphabets = {
    english: {
        chars: [...'ABCDEFGHIJKLMNOPQRSTUVWXYZ'],
        locale: 'en-US'
    },
    tamil: {
        chars: ['அ', 'ஆ', 'இ', 'ஈ', 'உ', 'ஊ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ', 'ஔ', 'ஃ',
            'க', 'ங', 'ச', 'ஞ', 'ட', 'ண', 'த', 'ந', 'ப', 'ம', 'ய', 'ர', 'ல', 'வ', 'ழ', 'ள', 'ற', 'ன'],
        locale: 'ta-IN'
    },
    hindi: {
        chars: [
            'अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ऋ', 'ए', 'ऐ', 'ओ', 'औ', 'अं', 'अः',
            'क', 'ख', 'ग', 'घ', 'ङ',
            'च', 'छ', 'ज', 'झ', 'ञ',
            'ट', 'ठ', 'ड', 'ढ', 'ण',
            'त', 'थ', 'द', 'ध', 'न',
            'प', 'फ', 'ब', 'भ', 'म',
            'य', 'र', 'ल', 'व',
            'श', 'ष', 'स', 'ह',
            'ळ', 'क्ष', 'त्र', 'ज्ञ'],
        locale: 'hi-IN'
    },
    bengali: {
        chars: [
            'অ', 'আ', 'ই', 'ঈ', 'উ', 'ঊ', 'ঋ', 'ঌ', 'এ', 'ঐ', 'ও', 'ঔ',
            'ক', 'খ', 'গ', 'ঘ', 'ঙ',
            'চ', 'ছ', 'জ', 'ঝ', 'ঞ',
            'ট', 'ঠ', 'ড', 'ঢ', 'ণ',
            'ত', 'থ', 'দ', 'ধ', 'ন',
            'প', 'ফ', 'ব', 'ভ', 'ম',
            'য', 'র', 'ল', 'শ', 'ষ', 'স', 'হ',
            'ড়', 'ঢ়', 'য়', 'ৎ'],
        locale: 'bn-IN'
    },
    telugu: {
        chars: [
            'అ', 'ఆ', 'ఇ', 'ఈ', 'ఉ', 'ఊ', 'ఋ', 'ౠ', 'ఌ', 'ఎ', 'ఏ', 'ఐ', 'ఒ', 'ఓ', 'ఔ', 'అం', 'అః',
            'క', 'ఖ', 'గ', 'ఘ', 'ఙ', 'చ', 'ఛ', 'జ', 'ఝ', 'ఞ',
            'ట', 'ఠ', 'డ', 'ఢ', 'ణ', 'త', 'థ', 'ద', 'ధ', 'న',
            'ప', 'ఫ', 'బ', 'భ', 'మ', 'య', 'ర', 'ఱ', 'ల', 'ళ', 'వ', 'శ', 'ష', 'స', 'హ',
            'క్ష', 'జ్ఞ'],
        locale: 'te-IN'
    },
    kannada: {
        chars: [
            'ಅ', 'ಆ', 'ಇ', 'ಈ', 'ಉ', 'ಊ', 'ಋ', 'ೠ', 'ಎ', 'ಏ', 'ಐ', 'ಒ', 'ಓ', 'ಔ', 'ಅಂ', 'ಅಃ',
            'ಕ', 'ಖ', 'ಗ', 'ಘ', 'ಙ', 'ಚ', 'ಛ', 'ಜ', 'ಝ', 'ಞ',
            'ಟ', 'ಠ', 'ಡ', 'ಢ', 'ಣ', 'ತ', 'ಥ', 'ದ', 'ಧ', 'ನ',
            'ಪ', 'ಫ', 'ಬ', 'ಭ', 'ಮ', 'ಯ', 'ರ', 'ಱ', 'ಲ', 'ಳ', 'ವ', 'ಶ', 'ಷ', 'ಸ', 'ಹ',
            'ಕ್ಷ', 'ಜ್ಞ'],
        locale: 'kn-IN'
    },
    malayalam: {
        chars: [
            'അ', 'ആ', 'ഇ', 'ഈ', 'ഉ', 'ഊ', 'ഋ', 'ൠ', 'ൡ', 'എ', 'ഏ', 'ഐ', 'ഒ', 'ഓ', 'ഔ',
            'ക', 'ഖ', 'ഗ', 'ഘ', 'ങ',
            'ച', 'ഛ', 'ജ', 'ഝ', 'ഞ',
            'ത', 'ഥ', 'ദ', 'ധ', 'ന',
            'പ', 'ഫ', 'ബ', 'ഭ', 'മ',
            'യ', 'ര', 'ല', 'വ',
            'ശ', 'ഷ', 'സ', 'ഹ',
            'ള', 'ഴ', 'റ'],
        locale: 'ml-IN'
    },
    gujarati: {
        chars: [
            'અ', 'આ', 'ઇ', 'ઈ', 'ઉ', 'ઊ', 'ઋ', 'ૠ', 'ૡ', 'ઌ', 'એ', 'ઐ', 'ઓ', 'ઔ',
            'ક', 'ખ', 'ગ', 'ઘ', 'ઙ',
            'ચ', 'છ', 'જ', 'ઝ', 'ઞ',
            'ટ', 'ઠ', 'ડ', 'ઢ', 'ણ',
            'ત', 'થ', 'દ', 'ધ', 'ન',
            'પ', 'ફ', 'બ', 'ભ', 'મ',
            'ય', 'ર', 'લ', 'ળ', 'વ',
            'શ', 'ષ', 'સ', 'હ',
            'ક્ષ', 'જ્ઞ'],
        locale: 'gu-IN'
    },
    punjabi: {
        chars: [
            'ਅ', 'ਆ', 'ਇ', 'ਈ', 'ਉ', 'ਊ', 'ਏ', 'ਐ', 'ਓ', 'ਔ',
            'ੳ', 'ਅ', 'ੲ',
            'ਕ', 'ਖ', 'ਖ਼', 'ਗ', 'ਗ਼', 'ਘ', 'ਙ',
            'ਚ', 'ਛ', 'ਜ', 'ਜ਼', 'ਝ', 'ਞ',
            'ਟ', 'ਠ', 'ਡ', 'ਢ', 'ਣ',
            'ਤ', 'ਥ', 'ਦ', 'ਧ', 'ਨ',
            'ਪ', 'ਫ', 'ਫ਼', 'ਬ', 'ਭ', 'ਮ',
            'ਯ', 'ਰ', 'ਲ', 'ਲ਼', 'ਵ', 'ੜ',
            'ਸ਼', 'ਸ', 'ਹ',
            'ਖ਼', 'ਗ਼', 'ਜ਼', 'ਫ਼', 'ਲ਼'],
        locale: 'pa-IN'
    },
    urdu: {
        chars: [
            'ا', 'آ', 'ب', 'پ', 'ت', 'ٹ', 'ث', 'ج', 'چ', 'ح', 'خ',
            'د', 'ڈ', 'ذ', 'ر', 'ڑ', 'ز', 'ژ', 'س', 'ش', 'ص', 'ض',
            'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ک', 'گ', 'ل', 'م', 'ن',
            'ں', 'و', 'ہ', 'ھ', 'ء', 'ی', 'ے'],
        locale: 'ur-IN'
    }
};

