window.alphabets = {
    english: {
        chars: [...'ABCDEFGHIJKLMNOPQRSTUVWXYZ'],
        locale: 'en-US'
    },
    tamil: {
        chars: ['அ', 'ஆ', 'இ', 'ஈ', 'உ', 'ஊ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ', 'ஔ', 'ஃ',
            'க', 'ங', 'ச', 'ஞ', 'ட', 'ண', 'த', 'ந', 'ப', 'ம', 'ய', 'ர', 'ல', 'வ', 'ழ', 'ள', 'ற', 'ன'],
        locale: 'ta-IN'
    },
    hindi: {
        chars: ['अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ए', 'ऐ', 'ओ', 'औ',
            'क', 'ख', 'ग', 'घ', 'च',
            'छ', 'ज', 'झ', 'ट', 'ठ',
            'ड', 'ढ', 'त', 'थ', 'द',
            'ध', 'न', 'प', 'फ', 'ब',
            'भ', 'म', 'य', 'र', 'ल',
            'व', 'श', 'ष', 'स', 'ह'],
        locale: 'hi-IN'
    },
};
